app/controllers/bigups_controller.rb

SELECT * FROM "bigups"
---
  def index
    @bigup = Bigup.new
    @bigups = Bigup.all

INSERT INTO "bigups" ("name", "created_at", "pic_content_type", "title", "updated_at", "pic_updated_at", "pic_file_size", "content", "pic_file_name") VALUES('', '2010-07-29 00:17:00', NULL, '', '2010-07-29 00:17:00', NULL, NULL, '', NULL)
---
  def create
    @bigup = Bigup.new(params[:bigup])
    if @bigup.save