app/controllers/pages_controller.rb

SELECT * FROM "bigups" LIMIT 30 OFFSET 0
---
  def home
    @bigups = Bigup.paginate(:page => params[:page])